src/Documents/ИТСервисы_ИзминениеПараметровИТСервиса/ИТСервисы_ИзминениеПараметровИТСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ИзминениеПараметровИТСервиса</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Развитие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сопровождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_ПараметрыИТСервисов/ИТСервисы_ПараметрыИТСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_ПараметрыИТСервисов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаРазвитии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСопровождении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДорожнаяКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриказОВводеВПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПаспортСервиса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Архитектура</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БазаЗнаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорТП</name>
    <type>
      <types>Boolean</types>
      <types>DocumentRef.ИТСервисы_ДоговорСТехническимПровайдером</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИТСервисы_ИзминениеПараметровИТСервиса/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
    Если ЗначениеЗаполнено(Объект.ИТСервис) Тогда
        ЗаполнитьПараметрыПоСервисуНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИТСервисПриИзменении(Элемент)
    Если НЕ ЗначениеЗаполнено(Объект.ИТСервис) Тогда
        ОчиститьПараметрыНаФорме();
        Возврат;
    КонецЕсли;
    
    ЗаполнитьПараметрыПоСервисуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    // Проверка на наличие изменений
    Если Не ЕстьИзменения() Тогда
        ПоказатьПредупреждение(, "Укажите хотя бы один изменяемый параметр!");
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЕстьИзменения()
    Возврат ЗначениеЗаполнено(Объект.Развитие) 
           ИЛИ ЗначениеЗаполнено(Объект.Сопровождение)
           ИЛИ ЗначениеЗаполнено(Объект.ПланПроектаВИСУП)
           ИЛИ ЗначениеЗаполнено(Объект.КодВАРМРазработчика)
           ИЛИ ЗначениеЗаполнено(Объект.Руководитель);
КонецФункции

&НаКлиенте
Процедура ОчиститьПараметрыНаФорме()
    Объект.Развитие = Ложь;
    Объект.Сопровождение = Ложь;
    Объект.ПланПроектаВИСУП = Ложь;
    Объект.КодВАРМРазработчика = "";
    Объект.Руководитель = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоСервисуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    ИТСервисы_ПараметрыИТСервисовСрезПоследних.НаРазвитии КАК НаРазвитии,
	|    ИТСервисы_ПараметрыИТСервисовСрезПоследних.НаСопровождении КАК НаСопровождении,
	|    ИТСервисы_ПараметрыИТСервисовСрезПоследних.ПланПроектаВИСУП КАК ПланПроектаВИСУП,
	|    ИТСервисы_ПараметрыИТСервисовСрезПоследних.КодВАРМРазработчика КАК КодВАРМРазработчика,
	|    ИТСервисы_ПараметрыИТСервисовСрезПоследних.Руководитель КАК Руководитель
	|ИЗ
	|    РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(&ТекущаяДата, ИТСервис = &ИТСервис) КАК ИТСервисы_ПараметрыИТСервисовСрезПоследних";
	
	Запрос.УстановитьПараметр("ИТСервис", Объект.ИТСервис);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Развитие = Выборка.НаРазвитии;
		Объект.Сопровождение = Выборка.НаСопровождении;
		Объект.ПланПроектаВИСУП = Выборка.ПланПроектаВИСУП;
		Объект.КодВАРМРазработчика = Выборка.КодВАРМРазработчика;
		Объект.Руководитель = Выборка.Руководитель;
	Иначе
		ОчиститьПараметрыНаФормеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПараметрыНаФормеНаСервере()
    Объект.Развитие = Ложь;
    Объект.Сопровождение = Ложь;
    Объект.ПланПроектаВИСУП = Ложь;
    Объект.КодВАРМРазработчика = "";
    Объект.Руководитель = Неопределено;
КонецПроцедуры
